In [1]:
import pandas as pd
import numpy as np

In [3]:
d = {'one': pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
         'two': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])} 
print(d)

{'one': a    1.0
b    2.0
c    3.0
dtype: float64, 'two': a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64}

In [6]:
df = pd.DataFrame(d)
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [5]:
pd.DataFrame(d, index=['d', 'b', 'a'])

   one  two
d  NaN  4.0
b  2.0  2.0
a  1.0  1.0

In [7]:
pd.DataFrame(d, index=['d', 'b', 'a'], columns=['two', 'three'])

   two three
d  4.0   NaN
b  2.0   NaN
a  1.0   NaN

In [8]:
d = {'one': [1., 2., 3., 4.],
         'two': [4., 3., 2., 1.]}
pd.DataFrame(d)

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

In [9]:
pd.DataFrame(d, index=['a', 'b', 'c', 'd'])

   one  two
a  1.0  4.0
b  2.0  3.0
c  3.0  2.0
d  4.0  1.0

In [10]:
pd.DataFrame(pd.Series(np.random.randn(5), name='something'))

   something
0   0.013177
1  -0.734424
2   0.193545
3   0.889605
4   0.838956

In [11]:
df['one']

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [12]:
df['three'] = df['one'] * df['two']

In [13]:
df['flag'] = df['one'] > 2

In [14]:
df

   one  two  three   flag
a  1.0  1.0    1.0  False
b  2.0  2.0    4.0  False
c  3.0  3.0    9.0   True
d  NaN  4.0    NaN  False

In [15]:
del df['two']
df

   one  three   flag
a  1.0    1.0  False
b  2.0    4.0  False
c  3.0    9.0   True
d  NaN    NaN  False

In [16]:
df['foo'] = 'bar'
df

   one  three   flag  foo
a  1.0    1.0  False  bar
b  2.0    4.0  False  bar
c  3.0    9.0   True  bar
d  NaN    NaN  False  bar

In [17]:
df['one_trunc'] = df['one'][:2]
df

   one  three   flag  foo  one_trunc
a  1.0    1.0  False  bar        1.0
b  2.0    4.0  False  bar        2.0
c  3.0    9.0   True  bar        NaN
d  NaN    NaN  False  bar        NaN

In [19]:
df = pd.DataFrame(np.random.randn(8, 3), columns=list('ABC'))
df

          A         B         C
0  0.326221  0.251911 -0.076836
1  1.244334 -0.548741 -0.561356
2  1.467413  1.646947 -0.314172
3 -0.142258 -2.053075  0.392470
4  0.500605 -0.710801 -1.248061
5 -1.417083  1.039875  1.164708
6  2.328152  2.171308  0.966919
7  1.472591  0.764505  0.070080

In [21]:
df * 5 + 2
1 / df

          A         B          C
0  3.065410  3.969663 -13.014658
1  0.803643 -1.822352  -1.781402
2  0.681471  0.607184  -3.182968
3 -7.029501 -0.487074   2.547964
4  1.997583 -1.406863  -0.801243
5 -0.705675  0.961654   0.858584
6  0.429525  0.460552   1.034213
7  0.679075  1.308036  14.269325

In [23]:
df1 = pd.DataFrame({'a': [1, 0, 1], 'b': [0, 1, 1]}, dtype=bool)
df1

       a      b
0   True  False
1  False   True
2   True   True

In [24]:
df2 = pd.DataFrame({'a': [0, 1, 1], 'b': [1, 1, 0]}, dtype=bool)
df2

       a      b
0  False   True
1   True   True
2   True  False

In [26]:
df1 & df2
df1 | df2
df1 ^ df2

       a      b
0   True   True
1   True  False
2  False   True